app/views/landing_pages/index.html.erb

SELECT `categories`.* FROM `categories`
---
<div class="container">
  <% @items.group_by(&:category).each do |category, items_by_category| %>