app/views/items/_item.html.erb

SELECT "field_details".* FROM "field_details" WHERE "field_details"."item_id" = ?  [["item_id", 1]]
---
  -->
  <% if item.field_details.present? %>