app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "Maris Lucas"], ["description", "Incidunt ut nihil q"], ["created_at", "2024-05-30 06:06:52.718807"], ["updated_at", "2024-05-30 06:06:52.718807"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

DELETE FROM `categories` WHERE `categories`.`id` = 2
---
  def destroy
    @category.destroy!