app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT `items`.* FROM `items`

  def create
    @item = Item.new(item_params)

    @item.user_id = current_user.id
    @item.save!
    if params[:fieldDetails]
      params[:fieldDetails].each do |key, value|
        field_detail = @item.field_details.build(field_name: value[:field_name], field_val: value[:field_val])
        field_detail.item_id = @item.id  # Set the item_id for each field
        field_detail.save!
      end
    end

    respond_to do |format|
      if @item.save
---
INSERT INTO `items` (`name`, `category`, `details`, `created_at`, `updated_at`, `user_id`) VALUES ('asd', 'Kamal Underwood', NULL, '2024-05-27 11:31:06.463476', '2024-05-27 11:31:06.463476', 1)
INSERT INTO "field_details" ("item_id", "field_name", "field_val", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["item_id", 1], ["field_name", "Lila Cortez"], ["field_val", "Vitae fuga Providen"], ["created_at", "2024-05-30 06:10:35.233059"], ["updated_at", "2024-05-30 06:10:35.233059"]]
INSERT INTO `field_details` (`item_id`, `field_name`, `field_val`, `created_at`, `updated_at`) VALUES (NULL, 'Hollee Pratt', 'Aspernatur fuga Qui', '2024-05-27 11:17:38.663098', '2024-05-27 11:17:38.663098')

  def update

    @item = Item.find(params[:id])

    @item.field_details.destroy_all
   # Extract and build fieldDetails from the incoming parameters
   if params[:fieldDetails]
     params[:fieldDetails].each do |key, value|
       field_detail = @item.field_details.build(field_name: value[:field_name], field_val: value[:field_val])
       field_detail.item_id = @item.id  # Set the item_id for each field
       field_detail.save!
     end
   end
   filtered_params = item_params.except(:field_details_attributes)
   respond_to do |format|
     if @item.update(filtered_params)
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM `items` WHERE `items`.`id` = 1
DELETE FROM "field_details" WHERE "field_details"."id" = ?  [["id", 6]]
SELECT `field_details`.* FROM `field_details` WHERE `field_details`.`item_id` = 10
INSERT INTO "field_details" ("item_id", "field_name", "field_val", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["item_id", 5], ["field_name", "Taylor Hawkins"], ["field_val", "Est in ullamco ex co"], ["created_at", "2024-05-30 11:09:30.561310"], ["updated_at", "2024-05-30 11:09:30.561310"]]
UPDATE `items` SET `items`.`details` = 'Roronoa Zoro, also known as \"Pirate Hunter\" Zoro, is a fictional character created by Japanese manga artist Eiichiro Oda who appears in the manga series and media franchise One Piece. He first appeared in the third chapter of the One Piece manga, published in the manga magazine Weekly Shōnen Jump in 1997.', `items`.`updated_at` = '2024-05-27 11:38:34.793217' WHERE `items`.`id` = 11

  def destroy
    @item = Item.find(params[:id])
    @item.field_details.destroy_all
    @item.destroy
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM `items` WHERE `items`.`id` = 12
DELETE FROM "field_details" WHERE "field_details"."id" = ?  [["id", 7]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 5]]

  def collections
    @items = current_user.items.group_by(&:category) # Fetch items for the current user and group by category
---
SELECT "items".* FROM "items" INNER JOIN "user_items" ON "items"."id" = "user_items"."item_id" WHERE "user_items"."user_id" = ?  [["user_id", 1]]

  def add_to_collection
    @item = Item.find(params[:id])
    unless current_user.items.include?(@item)
      current_user.items << @item
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "items" INNER JOIN "user_items" ON "items"."id" = "user_items"."item_id" WHERE "user_items"."user_id" = ? AND "items"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT `items`.* FROM `items` WHERE `items`.`id` = 12 LIMIT 1
INSERT INTO "user_items" ("user_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["item_id", 1], ["created_at", "2024-05-30 06:10:50.400121"], ["updated_at", "2024-05-30 06:10:50.400121"]]

  def remove_from_collection
    @item = Item.find(params[:id])
    # Assuming current_user is available and represents the logged-in user
    user_item = current_user.user_items.find_by(item_id: @item.id)
    user_item.destroy if user_item
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "user_items".* FROM "user_items" WHERE "user_items"."user_id" = ? AND "user_items"."item_id" = ? LIMIT ?  [["user_id", 1], ["item_id", 2], ["LIMIT", 1]]
DELETE FROM "user_items" WHERE "user_items"."id" = ?  [["id", 2]]

    def set_categories
      @categories = Category.all
---
SELECT `categories`.* FROM `categories`