app/controllers/tickets_controller.rb

  def show
    @ticket = Ticket.find(params[:id])
    @user = User.find_by(id: @ticket.user_id)
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 94], ["LIMIT", 1]]

  def create
    @ticket = Ticket.new(ticket_params)

    @ticket.user_id = current_user.id
    @ticket.save!
---
INSERT INTO "tickets" ("summary", "priority", "status", "reported", "collection", "link", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"