app/controllers/users_controller.rb

UPDATE "users" SET "updated_at" = ?, "user_name" = ? WHERE "users"."id" = ?  [["updated_at", "2024-05-30 11:11:22.572603"], ["user_name", "zabeer"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

DELETE FROM `users` WHERE `users`.`id` = 7
---
  def destroy
    @user.destroy!